OdIfcCoreModule.isCDAEnabled
\details
Retrieves whether the Common Data Access interface is available for the core IFC module.
\returns true if the CDA interface is enabled; otherwise, the method returns false.

OdIfcCoreModule.registerSchemaModule(OdExpSchemaModule*)
\details
Registers a module implements the support of an appropriate IFC schema.
\param expSchemaModule [in] A raw pointer to a module that supports the work with the schema.
\returns eOk the module was successfully registered; otherwise, the method returns an appropriate error code.

OdIfcCoreModule.uninitApp
\details
De-initializes the core IFC module.

OdIfcCoreModule.initApp
\details
Initializes the core IFC module.

OdIfcCoreModule
\details
An abstract class that provides the interface for a module that implements core IFC functionality.